Flatldap
========

  This does not work yet, this code only sets the basic idea.
* OS setup
gerhtest# cat /etc/libnss-ldap.conf 
host 127.0.0.1
base dc=qrux,dc=nl
ldap_version 3
rootbinddn cn=manager,dc=qrux,dc=nl
port 1389

gerhtest# cat /etc/libnss-ldap.secret 
123root

gerhtest# cat /etc/nsswitch.conf 
# /etc/nsswitch.conf
#
# Example configuration of GNU Name Service Switch functionality.
# If you have the `glibc-doc-reference' and `info' packages installed, try:
# `info libc "Name Service Switch"' for information about this file.

passwd:         files ldap
group:          files
shadow:         files

#hosts:         files 
hosts:          files dns
#hosts:          files dns
networks:       files

protocols:      db files
services:       db files
ethers:         db files
rpc:            db files

netgroup:       nis

* Starting the server
gerhtest# perl ./simple-server.pl &

* Testing
gerhtest# getent passwd

gerhtest# id bestaatwel
uid=5001(bestaatwel) gid=5001 groups=5001

